# ElecticalEquipWattage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElecticalEquipWattage Property
ParameterTypeId Class See Also
---
"Wattage"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElecticalEquipWattage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElecticalEquipWattage As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElecticalEquipWattage {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace